{
    "version": "https://jsonfeed.org/version/1",
    "title": "David WK",
    "description": "",
    "home_page_url": "https://davidwk.io",
    "feed_url": "https://davidwk.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "David K"
    },
    "items": [
        {
            "id": "https://davidwk.io/about-me/",
            "url": "https://davidwk.io/about-me/",
            "title": "About Me",
            "summary": "You have reached the obligatory \"about\" page. I'm from the Cincinnati-ish area of the Midwest. I'm a Scrum Master, a career I stumbled into when my technical skills went the way of the dinosaur. So now instead of writing horrible web applications, I coach teams on how to develop great&hellip;",
            "content_html": "<figure class=\"post__image post__image--left\"><img loading=\"lazy\"  src=\"https://davidwk.io/media/posts/4/davidk.jpeg\" alt=\"It's me. Hi.\" width=\"400\" height=\"400\" sizes=\"(max-width: 1200px) 100vw, 1200px\" srcset=\"https://davidwk.io/media/posts/4/responsive/davidk-xs.jpeg 300w ,https://davidwk.io/media/posts/4/responsive/davidk-sm.jpeg 480w ,https://davidwk.io/media/posts/4/responsive/davidk-md.jpeg 768w ,https://davidwk.io/media/posts/4/responsive/davidk-xl.jpeg 1200w\"></figure>You have reached the obligatory \"about\" page. I'm from the Cincinnati-ish area of the Midwest. I'm a Scrum Master, a career I stumbled into when my technical skills went the way of the dinosaur. So now instead of writing horrible web applications, I coach teams on how to develop great ones. I've been with my current company for over 10 years, which is a record for me, having come of age during the dot-com boom.</p>\n<p>My professional life doesn't define me, though. I'm also a dad, husband, and more recently, a grandfather. My last child will be out of the house in about 10 years, at which time I hope I'm not too old to do anything fun. </p>\n<p>I also enjoy astronomy, particularly public outreach. I'm a member of the local club. I own too many telescopes.</p>\n<p>This blog is a vanity project for sure, but it's also an outlet for talking about things I like, and working through things that bother me. Mostly I just try to write, regardless of the subject. It's good for my mental health.</p>\n<p>Feel free to <a href=\"mailto:nkastronomy@gmail.com\">contact me</a> if you like.</p>",
            "author": {
                "name": "David K"
            },
            "tags": [
            ],
            "date_published": "2023-08-29T15:36:49-04:00",
            "date_modified": "2023-08-29T15:39:46-04:00"
        },
        {
            "id": "https://davidwk.io/review-why-i-dont-recommend-do-do-sol-sol-la-la-sol/",
            "url": "https://davidwk.io/review-why-i-dont-recommend-do-do-sol-sol-la-la-sol/",
            "title": "Review - Why I Don&#x27;t Recommend &quot;Do-Do-Sol-Sol-La-La-Sol&quot;",
            "summary": "It's not often that I find a K-Drama that I won't recommend. Although I personally find most of the writing on South Korean television shows thoughtful and intentional, they're still subject to some of the usual pitfalls of any scripted show. Almost always, though, I find something about them to&hellip;",
            "content_html": "<p>It's not often that I find a K-Drama that I won't recommend. Although I personally find most of the writing on South Korean television shows thoughtful and intentional, they're still subject to some of the usual pitfalls of any scripted show. Almost always, though, I find something about them to recommend. </p>\n<p>\"Do-Do-Sol-Sol-La-La-Sol\" is one of the few I can't, in good conscience, recommend at all, despite all but the last five minutes being wonderful. What happens in those five minutes ruins everything that comes before it, though. My opinion, of course. Your enjoyment may have varied if you've seen it. Spoilers beyond this point.</p>\n<p>The male lead in \"Do-Do-Sol-Sol-La-La-Sol\" has a real problem with telling the truth. He has his reasons, but as the show goes on and he continues to lie to his girlfriend, you really have to wonder how she trusts him. It's the final lie that's the unforgivable sin for me, though.</p>\n<p>In the final episode, everyone is dealing with the death of Sunwoo Joon (Lee Jae-wook), the male lead and boyfriend of Goo Ra-ra (Go Ara), the charasmatic female lead. Sunwoo Joon's mother revealed in the penultimate episode that he had died from MS. Although heart-breaking, the final episode has some fantastic insight into dealing with grief and how different people move on in different ways. </p>\n<p>The problem is - Sunwoo Joon isn't actually dead! In the closing moments we get a \"5 years later\" prompt and we see how Ra-ra has dealt with her loss. Her piano academy is flourishing, her friends are all still there, supporting her. She's done well. Then in a scene that's confusing as hell, we see Joon, dressed in all black, running up to the academy building. Her bursts through the door and a total shit-show ensues.</p>\n<p>The final scene is Ra-ra and Joon sitting in a park, her crying uncontrollably and confused out of her mind. Joon tells her that he, once again, lied about being dead because he wanted to complete his treatment first (it takes 5 years to cure MS?). Add this to the long list of lies that included \"I'm studying abroad\" while in the hospital, \"I'm actually 19 and a high school senior\" instead of 23, and \"I'm just a tacitern loner\" instead of a run-away who hates his parents.</p>\n<p>The writers took a beautiful story about love, loss, grief, and perseverence and threw it into the trash because they couldn't stand a world where this couple isn't together. That final scene feels tacked-on, like a committee of executives decided that the audience wasn't intelligent enough to deal with such an emotional ending. It's a shame because this was almost one of my favorite shows.</p>\n<p>If you want to watch it, all I can recommend is that you turn it off when you see the screen say \"5 years later\". Accept that as the ending and maybe you'll find the show more enjoyable because you can't un-see the ending they actually give you.</p>",
            "image": "https://davidwk.io/media/posts/3/Do-Do-Sol-Sol-La-La-Sol3.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "review",
                   "k-drama"
            ],
            "date_published": "2023-08-29T11:56:36-04:00",
            "date_modified": "2023-08-29T15:23:14-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-aug-29-2023/",
            "url": "https://davidwk.io/daily-post-for-aug-29-2023/",
            "title": "Daily Post for Aug 29, 2023",
            "summary": "Starting an effort to write a little each day. This will likely be interesting to no one but me, and even that's questionable. But I've found in the past that a daily brain-dump can help clear out the cobwebs, especially when I've got a lot going on. Fair warning -&hellip;",
            "content_html": "<p>Starting an effort to write a little each day. This will likely be interesting to no one but me, and even that's questionable. But I've found in the past that a daily brain-dump can help clear out the cobwebs, especially when I've got a lot going on. Fair warning - this is mostly going to be verbal salad. A lot of random thoughts that aren't necessarily related.</p>\n<p>Room painting has been the major project the past few weekends. My office, Kid 5's room, and the upstairs bathroom. I hate painting. The taping alone is awful, let alone the actual process. But the final result makes it worth the effort. Maybe.</p>\n<p>Getting this blog setup has also been a project. A more enjoyable one, at that. I tinkered with <a href=\"https://astro.build/\" target=\"_blank\" rel=\"noopener noreferrer\">Astro CMS</a> and I really liked it, but it's overkill for someone who just wants a simple blog. Plus it reminded me that, although I have a web development background, my brain isn't really condusive to solving nit-picky little code issues. In the end, <a href=\"https://getpublii.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Publii</a> was the best option for me. It works with GitHub Pages and has a nice, easy-to-use interface. </p>\n<p>The hate-crime shooting in Jacksonville reminded me, once again, why I left that god-forsaken place. I still claim the Jaguars but not much else. It's a town full of douchebag CEOs and poor white trash masquerading as the middle class. It's got a lot of \"angry white guy\" energy. I don't miss it.</p>\n<p>Started a couple of new shows in the K-Drama category: \"Law School\" and \"Memories of the Alhambra\". I'm not sure I'm going to like either of them because they both have a very \"American\" style. It's similar to why I haven't returned to \"Vagabond\" yet (even the presence of Bae Suzy hasn't coerced me yet). The quirkiness is what I love about South Korean television. If I want to watch an over-stylized, loud show with murder, explosions, and no self-awareness, I'd watch any of the scripted programs on NBC.</p>",
            "image": "https://davidwk.io/media/posts/2/IMG_3929.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-08-29T11:49:22-04:00",
            "date_modified": "2023-08-29T11:49:22-04:00"
        },
        {
            "id": "https://davidwk.io/my-k-drama-list/",
            "url": "https://davidwk.io/my-k-drama-list/",
            "title": "My K-Drama List",
            "summary": "I’m a HUGE fan of South Korean television, more commonly referred to as “K-Drama”. It started with “Squid Game”, but it didn’t take me long to deep-dive into the enormous K-Drama library on Netflix. “Extraordinary Attorney Woo” was the show that really hooked me. Since then, most of my streaming&hellip;",
            "content_html": "<p>I’m a HUGE fan of South Korean television, more commonly referred to as “K-Drama”. It started with “Squid Game”, but it didn’t take me long to deep-dive into the enormous K-Drama library on Netflix. “Extraordinary Attorney Woo” was the show that really hooked me. Since then, most of my streaming time has been spent on South Korean television. </p>\n<p>I’m going to be slowly expanding this list to include my thoughts on each show, and I’ll be using tags to help others sort through them and find things they like. For now, and without any spoilers, here are some quick recommendations. Unless specified otherwise, these are all available on Netflix in the US.</p>\n<p><strong>My Personal Favorite</strong> - Extraordinary Attorney Woo</p>\n<p><strong>RomCom Shows</strong> - Because This is My First Life, Romance is a Bonus Book</p>\n<p><strong>Dramatic Love Stories</strong> - Twenty-Five Twenty-One, Rain or Shine</p>\n<p><strong>Supernatural Shows</strong> - The Uncanny Counter, Tomorrow</p>\n<p><strong>Action Dramas</strong> - My Name, The Glory</p>\n<h3 id=\"the-list\">The List</h3>\n<table>\n<thead>\n<tr>\n<th>Title</th>\n<th>Korean Title</th>\n<th>Recommended?</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Because This is My First Life</td>\n<td>이번 생은 처음이라</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Summer Strike</td>\n<td>아무것도 하고 싶지 않아</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>The Silent Sea</td>\n<td>고요의 바다</td>\n<td>Maybe</td>\n</tr>\n<tr>\n<td><a href=\"/review-why-i-dont-recommend-do-do-sol-sol-la-la-sol\">Do Do Sol Sol La La Sol</a></td>\n<td>도도솔솔라라솔</td>\n<td>No</td>\n</tr>\n<tr>\n<td>Tomorrow</td>\n<td>내일</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Extraordinary Attorney Woo</td>\n<td>이상한 변호사 우영우</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Hometown Cha Cha Cha</td>\n<td>갯마을 차차차</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>It’s Okay to Not Be Okay</td>\n<td>사이코지만 괜찮아</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Start Up</td>\n<td>스타트업</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Twenty-Five Twenty-One</td>\n<td>스물다섯 스물하나</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>My Liberation Notes</td>\n<td>나의 해방일지</td>\n<td>Maybe</td>\n</tr>\n<tr>\n<td>Romance is a Bonus Book</td>\n<td>로맨스는 별책부록</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>King the Land</td>\n<td>킹더랜드</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Rain or Shine</td>\n<td>그냥 사랑하는 사이</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>The Uncanny Counter</td>\n<td>경이로운 소문</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>The Glory</td>\n<td>더 글로리</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Hellbound</td>\n<td>지옥</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Squid Game</td>\n<td>오징어 게임</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>My Name</td>\n<td>마이 네임</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Crash Course in Romance</td>\n<td>일타 스캔들</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Inspector Koo</td>\n<td>구경이</td>\n<td>Yes</td>\n</tr>\n</tbody></table>\n",
            "image": "https://davidwk.io/media/posts/1/uncanny.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "k-drama"
            ],
            "date_published": "2023-08-29T09:21:07-04:00",
            "date_modified": "2023-08-29T14:55:22-04:00"
        }
    ]
}
