{
    "version": "https://jsonfeed.org/version/1",
    "title": "David WK",
    "description": "",
    "home_page_url": "https://davidwk.io",
    "feed_url": "https://davidwk.io/feed.json",
    "user_comment": "",
    "icon": "https://davidwk.io/media/website/davidwk_01.png",
    "author": {
        "name": "David K"
    },
    "items": [
        {
            "id": "https://davidwk.io/information-for-the-october-14-2023-solar-eclipse/",
            "url": "https://davidwk.io/information-for-the-october-14-2023-solar-eclipse/",
            "title": "Information for the October 14, 2023 Solar Eclipse",
            "summary": "Here are some details about the upcoming Annular eclipse. What is an Annular Eclipse - An annular eclipse is a type of solar eclipse that occurs when the Moon is at apogee, which is the point in its orbit farthest from the Earth. During an annular eclipse, the Moon is&hellip;",
            "content_html": "<p>Here are some details about the upcoming Annular eclipse.</p>\n<p> <strong>What is an Annular Eclipse</strong>\n        - An annular eclipse is a type of solar eclipse that occurs when the Moon is at apogee, which is the point in its orbit farthest from the Earth. During an annular eclipse, the Moon is slightly smaller in apparent size than the Sun, resulting in a visible ring of sunlight around the darkened Moon. This creates a “ring of fire” effect, where the Sun appears as a bright ring surrounding the Moon. Annular eclipses happen when the Moon’s shadow falls on the Earth, but does not completely cover the Sun.</p>\n<p><strong>What are types of solar eclipses?</strong>\n        - There are three main types of solar eclipses:\n            - <em>Total Solar Eclipse</em>: This occurs when the Moon completely blocks the view of the Sun from a certain location on Earth. The Moon aligns perfectly between the Sun and Earth, creating a dark shadow called the umbra, which falls on a specific region on Earth. During a total solar eclipse, the sky becomes dark, stars become visible, and the Sun’s outer atmosphere, known as the corona, can be seen.\n            - <em>Partial Solar Eclipse</em>: In a partial solar eclipse, the Moon only partially covers the Sun. It occurs when the Sun, Moon, and Earth are not perfectly aligned, resulting in the Moon casting only a partial shadow called the penumbra on Earth’s surface. In this type of eclipse, the Sun appears to have a dark bite taken out of it.\n            - <em>Annular Solar Eclipse</em>: An annular solar eclipse happens when the Moon is farthest from Earth in its elliptical orbit, causing it to appear smaller compared to the Sun. As a result, the Moon does not fully cover the Sun, and a ring of the Sun’s disk can be seen around the Moon. This creates a “ring of fire” effect, where the Sun appears as a bright ring around the dark silhouette of the Moon.</p>\n<p><strong>How big are sunspots?</strong>\n        - Sunspots can vary in size, but on average, they can be as large as Earth or even larger. The largest sunspots observed have reached diameters of around 50,000 kilometers (31,000 miles) or more.\n        - <em>What is the diameter of the earth, in comparison?</em>\n            - The diameter of the Earth is approximately 12,742 kilometers (7,918 miles).</p>\n<p><strong>How big are solar flares?</strong>\n        - Solar flares can vary in size, ranging from relatively small events to extremely large eruptions. The size of a solar flare is typically measured in terms of its energy release, which is expressed in terms of the energy per unit area. This unit is known as ‘ergs’ or ‘joules’ per square centimeter. \n          Solar flares can release energy anywhere from 10^29 to 10^32 ergs, and the largest ones are known as X-class flares. These X-class flares can release energy on the order of 10^32 ergs, which is equivalent to the energy released by billions of nuclear bombs. These are the most powerful and largest solar flares, capable of causing significant disruptions on Earth, such as radio blackouts and geomagnetic storms.<br>        - <em>What is the physical size of solar flares?</em>\n            - Solar flares can vary in size, but on average they extend to a few thousand kilometers in diameter. <em>The largest recorded solar flare, known as the Carrington event in 1859, was estimated to be about 50 times the size of Earth, spanning over 300,000 kilometers in diameter</em>. However, most solar flares are smaller, ranging from a few thousand to tens of thousands of kilometers in size.</p>\n<p><strong>When is the next solar eclipse and what type will it be?</strong>\n        - The next solar eclipse that will occur in 2024 will take place on April 8th, 2024. It will be a total solar eclipse, meaning the moon will completely block the sun’s light, casting a shadow on Earth.\n        - <em>Will this eclipse be visible in Cincinnati?</em>\n          id:: 652406dc-8a99-4f11-bcd3-63f698fe832a\n            - Yes, the 2024 solar eclipse will be visible in Cincinnati. On April 8, 2024, a total solar eclipse will be visible across parts of the United States, including Cincinnati, Ohio.\n        - <em>What percentage of totality will Cincinnati experience during the 2024 solar eclipse?</em>\n            - Cincinnati, Ohio, will experience a maximum eclipse obscuration of approximately <strong>92.5%</strong> during the 2024 solar eclipse.\n        - Details on the 2024 eclipse: <a href=\"https://www.timeanddate.com/eclipse/map/2024-april-8#@32.660908043942094,-93.15914221218962,5\">April 8, 2024 Eclipse at TimeandDate.com</a></p>\n<p><strong>What are some of the effects solar eclipses have on nature?</strong>\n        - Solar eclipses can have several effects on nature:\n            - <em>Animal behavior</em>: Many animals, especially birds, insects, and other animals that rely on daylight, may exhibit unusual behavior during a solar eclipse. Some birds may stop singing, return to their nests, or become more active as they mistake the sudden darkness for nighttime. Insects, such as bees, may return to their hives, while nocturnal animals may become more active.\n            - <em>Temperature changes</em>: During a solar eclipse, there is a sudden decrease in temperature due to the absence of sunlight. This can impact plants and animals, affecting their growth, metabolism, and overall behavior. Cooler temperatures might trigger certain plants to close their flowers or leaves temporarily.\n            - <em>Light and shadows</em>: Solar eclipses can create unique patterns of light and shadow on the ground. As the sun’s rays are partially blocked, the leaves of the trees act like pinhole cameras, projecting crescent-shaped images of the eclipse onto the ground. These intricate patterns can be fascinating to observe.\n            - <em>Changes in air pressure</em>: During an eclipse, the sudden drop in temperature can lead to a slight decrease in air pressure. This change in atmospheric pressure may affect certain sensitive organisms and their perception of the environment.\n            - <em>Influence on migratory patterns</em>: Some studies suggest that solar eclipses can affect the migration patterns of certain birds and insects. The sudden darkness may cause disruptions in their navigation, causing them to alter their flight paths or pause their migration temporarily.\n            - <em>Impact on plant life</em>: Plants rely on sunlight for photosynthesis, the process by which they convert sunlight into energy. During an eclipse, the decrease in sunlight can affect plant growth temporarily. However, since a solar eclipse is usually short-lived, its impact on plants is generally minimal.\n        - <em>It is worth mentioning that the above effects may vary depending on the duration and intensity of the eclipse, as well as the geographical region where it occurs.</em></p>\n",
            "author": {
                "name": "David K"
            },
            "tags": [
            ],
            "date_published": "2023-10-09T10:18:08-04:00",
            "date_modified": "2023-10-09T10:20:58-04:00"
        },
        {
            "id": "https://davidwk.io/favorite-way-to-start-my-day/",
            "url": "https://davidwk.io/favorite-way-to-start-my-day/",
            "title": "Favorite Way to Start My Day",
            "summary": "South Korean street broadcasters are the bomb (as the kids say). My personal favorite is Kenneth, who usually starts during my morning, 8-9pm in South Korea. He takes his viewers all over Seoul - the busy districts like Hongdae, the area around Namsan Tower, and even the outlying temples and&hellip;",
            "content_html": "<p>South Korean street broadcasters are the bomb (as the kids say). My personal favorite is Kenneth, who usually starts during my morning, 8-9pm in South Korea. He takes his viewers all over Seoul - the busy districts like Hongdae, the area around Namsan Tower, and even the outlying temples and gardens. He seems like a genuinely happy guy who enjoys interacting with his audience. Some of my favorite moments are when he navigates the alleyways of Seoul's neighborhoods looking for feral cats, which he frequently feeds and plays with. </p>\n<p>I happily endorse this fantastic content! Check him out <a href=\"https://www.tiktok.com/@hanriverlureman\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://davidwk.io/media/posts/23/IMG_0127.PNG\" alt=\"A view of Kenneth's live stream\" width=\"1290\" height=\"2796\" sizes=\"(max-width: 1200px) 100vw, 1200px\" srcset=\"https://davidwk.io/media/posts/23/responsive/IMG_0127-xs.PNG 300w ,https://davidwk.io/media/posts/23/responsive/IMG_0127-sm.PNG 480w ,https://davidwk.io/media/posts/23/responsive/IMG_0127-md.PNG 768w ,https://davidwk.io/media/posts/23/responsive/IMG_0127-xl.PNG 1200w\"></figure>",
            "image": "https://davidwk.io/media/posts/23/kenneth.png",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "tiktok",
                   "street broadcasters",
                   "k-content"
            ],
            "date_published": "2023-10-04T09:47:17-04:00",
            "date_modified": "2023-10-04T09:47:17-04:00"
        },
        {
            "id": "https://davidwk.io/k-review-business-proposal/",
            "url": "https://davidwk.io/k-review-business-proposal/",
            "title": "K-Review - Business Proposal",
            "summary": "They hype around \"Business Proposal\" was a bit overblown, in my opinion. It's certainly a fun show to watch, and it has a lot of very well-constructed moments. But ultimately I liked those moments instead of how the story came together as a whole. A lot of the hype was&hellip;",
            "content_html": "<p>They hype around \"Business Proposal\" was a bit overblown, in my opinion. It's certainly a fun show to watch, and it has a lot of very well-constructed moments. But ultimately I liked those moments instead of how the story came together as a whole.</p>\n<p>A lot of the hype was around Kim Se-jeong and it's well-deserved. Her acting is effortless, completely natural, and genuine. The small group of actors who make up her work team are all a bit over-the-top, but it plays well off her more subtle performance. Those scenes with her co-workers were the ones I enjoyed the most throughout the series.</p>\n<p>So many of the over-arching story threads felt like they were abandoned or wrapped up too neatly, though. The one that felt most neglected was the resolution with Tae-moo's grandfather. In the end we don't get any resolution between him and Shin Ha-ri - just a brief comment about how he's still in America. It's like they ran out of episodes to fully close his part of the story.</p>\n<p>I still recommend watching \"Business Proposal\", but don't expect too much from it plot-wise. Watch it for the well-developed characters and the brilliant performance by Kim Se-jeong.</p>",
            "image": "https://davidwk.io/media/posts/22/Business-Proposal-Kdrama-Season-2.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "review",
                   "k-drama"
            ],
            "date_published": "2023-10-03T14:08:22-04:00",
            "date_modified": "2023-10-03T14:08:22-04:00"
        },
        {
            "id": "https://davidwk.io/airplanes-and-nebulae/",
            "url": "https://davidwk.io/airplanes-and-nebulae/",
            "title": "Airplanes and Nebulae",
            "summary": "There's a lot of \"stuff\" up there in the sky in addition to the objects astronomers are usually trying to view. This photo is a live stack (about 3 minutes here) of the Triffid Nebula. The lines and red dots over it are from an airplane that flew through the&hellip;",
            "content_html": "<p>There's a lot of \"stuff\" up there in the sky in addition to the objects astronomers are usually trying to view. This photo is a live stack (about 3 minutes here) of the Triffid Nebula. The lines and red dots over it are from an airplane that flew through the field of view during an exposure.</p>\n<p>At least it wasn't Starlink.</p>",
            "image": "https://davidwk.io/media/posts/21/triffid-airplane.png",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "eaa",
                   "astronomy"
            ],
            "date_published": "2023-10-03T13:47:20-04:00",
            "date_modified": "2023-10-03T13:47:20-04:00"
        },
        {
            "id": "https://davidwk.io/here-comes-the-sun/",
            "url": "https://davidwk.io/here-comes-the-sun/",
            "title": "Here Comes the Sun",
            "summary": "Imaging the Sun in Calcium K reveals a lot of detail. These were taken on Sep 22, 2023 from my back yard. Seeing was perfect. Technically speaking, the best result I got was with stacking 30% of 5000 frames.",
            "content_html": "<p>Imaging the Sun in Calcium K reveals a lot of detail. These were taken on Sep 22, 2023 from my back yard. Seeing was perfect. Technically speaking, the best result I got was with stacking 30% of 5000 frames.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/20/gallery/14_08_18_Surface_50_Sharp20_B1.0_C1.0_S1_N1.png\" data-size=\"1700x1600\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/20/gallery/14_08_18_Surface_50_Sharp20_B1.0_C1.0_S1_N1-thumbnail.png\" alt=\"\" width=\"768\" height=\"723\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/20/gallery/14_08_18_Surface_50_Sharp20_B7.0_C0.7_S27_N33_SUN.png\" data-size=\"1000x1007\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/20/gallery/14_08_18_Surface_50_Sharp20_B7.0_C0.7_S27_N33_SUN-thumbnail.png\" alt=\"\" width=\"768\" height=\"773\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/20/gallery/14_57_53_Surface_60_Sharp20_B1.0_C0.3_S1_N1-bw.png\" data-size=\"1760x1737\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/20/gallery/14_57_53_Surface_60_Sharp20_B1.0_C0.3_S1_N1-bw-thumbnail.png\" alt=\"\" width=\"768\" height=\"758\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/20/gallery/14_57_53_Surface_60_Sharp20_B1.0_C0.3_S1_N1.png\" data-size=\"1760x1737\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/20/gallery/14_57_53_Surface_60_Sharp20_B1.0_C0.3_S1_N1-thumbnail.png\" alt=\"\" width=\"768\" height=\"758\"></a></figure>\n</div></div>",
            "image": "https://davidwk.io/media/posts/20/14_57_53_Surface_60_Sharp20_B1.0_C0.3_S1_N1.png",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "solar",
                   "astronomy"
            ],
            "date_published": "2023-09-22T15:49:48-04:00",
            "date_modified": "2023-09-22T15:49:48-04:00"
        },
        {
            "id": "https://davidwk.io/eaa-session-for-91823/",
            "url": "https://davidwk.io/eaa-session-for-91823/",
            "title": "EAA Session for 9/18/23",
            "summary": "I was able to catch the Triangulum Galaxy (M33, pictured above) and Saturn last night. Both images are pretty rough but I was happy with the Saturn result. This was all done on the 80mm refractor. I'm going to attempt Jupiter and Saturn tonight with my Celestron 8se on the&hellip;",
            "content_html": "<p>I was able to catch the Triangulum Galaxy (M33, pictured above) and Saturn last night. Both images are pretty rough but I was happy with the Saturn result. This was all done on the 80mm refractor. I'm going to attempt Jupiter and Saturn tonight with my Celestron 8se on the EAA mount and see if I can get better results. I'm also going to give it a try with the atmospheric dispersion corrector and see if I can remove some of the fringing.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://davidwk.io/media/posts/19/2023-09-18-222336-Saturn-Bin1-20.5C_lapl5_ap1_Drizzle30_conv.png\" alt=\"A photo of Saturn\" width=\"655\" height=\"612\" sizes=\"(max-width: 1200px) 100vw, 1200px\" srcset=\"https://davidwk.io/media/posts/19/responsive/2023-09-18-222336-Saturn-Bin1-20.5C_lapl5_ap1_Drizzle30_conv-xs.png 300w ,https://davidwk.io/media/posts/19/responsive/2023-09-18-222336-Saturn-Bin1-20.5C_lapl5_ap1_Drizzle30_conv-sm.png 480w ,https://davidwk.io/media/posts/19/responsive/2023-09-18-222336-Saturn-Bin1-20.5C_lapl5_ap1_Drizzle30_conv-md.png 768w ,https://davidwk.io/media/posts/19/responsive/2023-09-18-222336-Saturn-Bin1-20.5C_lapl5_ap1_Drizzle30_conv-xl.png 1200w\"></figure>",
            "image": "https://davidwk.io/media/posts/19/2023-09-19-09-57-38.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "eaa",
                   "astronomy"
            ],
            "date_published": "2023-09-19T12:43:33-04:00",
            "date_modified": "2023-09-19T14:58:03-04:00"
        },
        {
            "id": "https://davidwk.io/k-review-diary-of-a-prosecutor/",
            "url": "https://davidwk.io/k-review-diary-of-a-prosecutor/",
            "title": "K-Review - Diary of a Prosecutor",
            "summary": "I recently finished “Diary of a Prosecutor” and I highly recommend it! Lee Sun Kyung as Prosecutor Lee has amazing comedic presence and holds his own in the dramatic department as well. The ensemble cast is brilliant in typical K-drama fashion and play well off each other. Each episode is&hellip;",
            "content_html": "<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">I recently finished “Diary of a Prosecutor” and I highly recommend it!</div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\"><a href=\"https://www.wikiwand.com/en/Lee_Sun-kyun\" target=\"_blank\" rel=\"noopener noreferrer\">Lee Sun Kyung</a> as Prosecutor Lee has amazing comedic presence and holds his own in the dramatic department as well. The ensemble cast is brilliant in typical K-drama fashion and play well off each other.</div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\">Each episode is more or less self-contained although there are several overarching plot lines that carry through to the end. I’d call this show “comfort food” type viewing. It’s <a tabindex=\"-1\"></a>definitely “bingeable” - as bingeable as any K-drama at 16, hour-plus episodes - but something probably enjoyed at a more normal pace and one I would enjoy rewatching.</div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\"><a href=\"https://www.wikiwand.com/en/Kim_Kwang-kyu_(actor)\" target=\"_blank\" rel=\"noopener noreferrer\">Kim Kwang iyu</a> has become one of my favorite character actors in South Korean television and he's very funny as Prosecutor Hong, a very self-conscious public servant of 14 years. I'm currently enjoying his small role in \"Business Proposal\" as Kim Sejeong's father.</div>\n<div dir=\"auto\"> </div>\n</div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">And I would be remiss if I didn’t mention <a href=\"https://www.wikiwand.com/en/Jung_Ryeo-won\" target=\"_blank\" rel=\"noopener noreferrer\">Jung Ryeowon</a> as Prosecutor Cha. What a subtle, understated performance!</div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://davidwk.io/media/posts/18/dap2.jpeg\" alt=\"Cast of Diary of a Prosecutor\" width=\"780\" height=\"439\" sizes=\"(max-width: 1200px) 100vw, 1200px\" srcset=\"https://davidwk.io/media/posts/18/responsive/dap2-xs.jpeg 300w ,https://davidwk.io/media/posts/18/responsive/dap2-sm.jpeg 480w ,https://davidwk.io/media/posts/18/responsive/dap2-md.jpeg 768w ,https://davidwk.io/media/posts/18/responsive/dap2-xl.jpeg 1200w\"></figure></div>\n</div>",
            "image": "https://davidwk.io/media/posts/18/dap.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "review",
                   "recommended",
                   "k-drama"
            ],
            "date_published": "2023-09-18T09:13:39-04:00",
            "date_modified": "2023-09-18T09:23:26-04:00"
        },
        {
            "id": "https://davidwk.io/eaa-first-real-success/",
            "url": "https://davidwk.io/eaa-first-real-success/",
            "title": "EAA First Real Success",
            "summary": "For several months I've been struggling to setup an EAA (electronically assisted astronomy) telescope. It's been a very difficult process with a lot of trial and error. Last night, however, I had my first big success imaging M31, pictured above. This final view is approximately 5-10 minutes of total exposure&hellip;",
            "content_html": "<p>For several months I've been struggling to setup an EAA (electronically assisted astronomy) telescope. It's been a very difficult process with a lot of trial and error. Last night, however, I had my first big success imaging M31, pictured above. This final view is approximately 5-10 minutes of total exposure time, but the intent of EAA is to offer near-real-time views of dark sky objects. M31 is generally an easy target because it's so bright and large, but this was the first time I got a good image. After months of giving up and restarting, the work finally paid off.</p>\n<p>This is going to be a great setup to take out for public observing. For objects like Saturn and Jupiter I still prefer a regular telescope with an eyepiece because people seem to have a visceral connection seeing them that way. But the dimmer objects like galaxies, nebulae, and star clusters rarely resolve to anything more than \"dim fuzzies\" under city skies, even in large telescopes. EAA allows people to see these objects closer to what they actually look like in long-exposure photography. It's a fantastic tool to get people interested.</p>\n<p>I was able to capture several other objects during the evening. Here's a few of the best.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0155.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0155-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0156.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0156-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0159.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0159-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0160.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0160-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0162.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0162-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0166.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0166-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0170.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0170-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/17/gallery/IMG_0171.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/17/gallery/IMG_0171-thumbnail.PNG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n</div></div>",
            "image": "https://davidwk.io/media/posts/17/MicrosoftTeams-image-4.png",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "eaa",
                   "astronomy"
            ],
            "date_published": "2023-09-15T12:59:06-04:00",
            "date_modified": "2023-09-15T12:59:06-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-sep-13-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-13-2023/",
            "title": "Daily Post for Sep 13, 2023",
            "summary": "Monday was the anniversary of 9/11. I have very mixed feelings about that particular day. That day was awful, and I certainly want those who were lost and the heroes that emerged to be remembered. I also feel like it was our responsibility to find those responsible and bring them&hellip;",
            "content_html": "<p>Monday was the anniversary of 9/11. I have very mixed feelings about that particular day. That day was awful, and I certainly want those who were lost and the heroes that emerged to be remembered. I also feel like it was our responsibility to find those responsible and bring them to justice. However, so much evil was done by our country in the name of retribution that I can't fully embrace it. The US has always had a problematic past when it comes to the treatment of others. 9/11 was an excuse for those who already had hate in their heart to put that hate into action. As a result we fabricated evidence and used it to invade a country that wasn't even involved. It essentially gave Bush Jr. an opportunity to finish the war his father started and lost, over oil. That day marked a change in our politics that led to extremism in conservative circles. Guantanamo and Abu Ghraib are atrocities that our politicians enabled in the name of justice. It sickens me that we became monsters willingly in order to feel safer.</p>",
            "image": "https://davidwk.io/media/posts/16/wtc.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-09-13T08:44:36-04:00",
            "date_modified": "2023-09-13T08:48:06-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-sep-9-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-9-2023/",
            "title": "Daily Post for Sep 9, 2023",
            "summary": "I'm starting to question my use of Publii as a blogging tool. I'm noticing it getting slower the more I write, and I haven't written that much. I'm also wanting a mobile option for posting and there's none of that on the horizon. Since I'm spending so much time in&hellip;",
            "content_html": "<p>I'm starting to question my use of Publii as a blogging tool. I'm noticing it getting slower the more I write, and I haven't written that much. I'm also wanting a mobile option for posting and there's none of that on the horizon. Since I'm spending so much time in Logseq these days, I might try out the Hugo integration and see if it's just as easy. I wouldn't mind having all this backed up in my primary note taking system, and Logseq has a great mobile app.</p>\n<p>Kid 5's team won their soccer game today. They're undefeated this season and even running up the score a little bit. I think they've allowed one goal in 3-4 games. We're talking 9 year olds here, but their confidence is off the charts after being together for several years. They're fun to watch.</p>\n<p>Astronomy outreach event tonight. This is my favorite part of the hobby, and this time of year it's even better with all the amazement at seeing Saturn through a telescope for the first time. I'm overdoing it, as usual, taking my 12\" Dob, 8\" Celestron, and binoculars, but what's the point of having this stuff if you don't use it to inspire the next generation of astronomy nerds?</p>\n<p>Finally feeling back to normal after being sick for three days. It wasn't COVID, but it sure felt like it. </p>",
            "image": "https://davidwk.io/media/posts/15/frye-sus.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-09-09T14:03:55-04:00",
            "date_modified": "2023-09-09T14:03:55-04:00"
        }
    ]
}
