{
    "version": "https://jsonfeed.org/version/1",
    "title": "David WK",
    "description": "",
    "home_page_url": "https://davidwk.io",
    "feed_url": "https://davidwk.io/feed.json",
    "user_comment": "",
    "icon": "https://davidwk.io/media/website/davidwk_01.png",
    "author": {
        "name": "David K"
    },
    "items": [
        {
            "id": "https://davidwk.io/daily-post-for-sep-7-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-7-2023/",
            "title": "Daily Post for Sep 7, 2023",
            "summary": "I did not sleep well last night. This morning I feel like the dead, but I'm going to power through it. Too many stimulants yesterday to make me functional for my in-office day must have taken their toll. I'm really taking a liking to Logseq. Now that I've got the&hellip;",
            "content_html": "<p>I did not sleep well last night. This morning I feel like the dead, but I'm going to power through it. Too many stimulants yesterday to make me functional for my in-office day must have taken their toll.</p>\n<p>I'm really taking a liking to Logseq. Now that I've got the basics down, I'm moving quickly through my daily journaling and keeping track of my to-dos. One of them is a daily reminder to write this post. It worked, obviously.</p>\n<p>I ordered a copy of the National Geographic Stargazer's Atlas. I'm more excited than I should be for a book. Nerd-mode engaged.</p>\n<p>My recently moved-out teenager finally found a decent job, and might have an apartment soon. He doesn't give a lot of details and I don't ask, but I'm certainly proud of him. This is huge progress over where he was a couple of months ago.</p>\n<p>Speaking of which, life is much calmer without him in the house. We all needed space. It's not easy on a family when they have to deal with another member's trauma, particularly when they don't want to help themselves. I think being on his own has been a net positive.</p>",
            "image": "https://davidwk.io/media/posts/14/cris-saur-GNUcUx-iObg-unsplash.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
            ],
            "date_published": "2023-09-07T09:03:18-04:00",
            "date_modified": "2023-09-07T09:03:18-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-sep-6-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-6-2023/",
            "title": "Daily Post for Sep 6, 2023",
            "summary": "Not much to update for today, but since I missed yesterday I better make an effort to keep with the habit. It was another day in the office. I was oddly productive. I'll have to consult my scientists to see why that might be. I was able to work a&hellip;",
            "content_html": "<p>Not much to update for today, but since I missed yesterday I better make an effort to keep with the habit.</p>\n<p>It was another day in the office. I was oddly productive. I'll have to consult my scientists to see why that might be.</p>\n<p>I was able to work a lot with Logseq today and really enjoyed it. I'm getting some of the basic keyboard commands down, in addition to building a habit of logging things more. Tonight Kid 5 and I made a list of some cabins we would like to visit and created <a href=\"https://davidwk.io/cabins-we-like/\">this page</a> to keep track. We generated the Markdown in Logseq and exported it here.</p>",
            "image": "https://davidwk.io/media/posts/12/cabin.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-09-06T20:33:58-04:00",
            "date_modified": "2023-09-06T20:43:27-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-sep-4-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-4-2023/",
            "title": "Daily Post for Sep 4, 2023",
            "summary": "In order to avoid physical labor, I've been spending a couple of days setting up Logseq for keeping notes and task lists. When digging through the available plugins I found one for ChatGPT. Now, I don't think what we're calling \"AI\" these days is actually AI. There's no real intelligence&hellip;",
            "content_html": "<p>In order to avoid physical labor, I've been spending a couple of days setting up <a href=\"https://logseq.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Logseq</a> for keeping notes and task lists. When digging through the available plugins I found one for ChatGPT. Now, I don't think what we're calling \"AI\" these days is actually AI. There's no real intelligence there, and these systems aren't thinking for themselves. We've just gotten very good at training these large language models to write text that sounds like a person wrote it. But what we CAN do is still pretty cool. Here's an example of the output you get when I asked it to write a summary for \"The Uncanny Counter\".</p>\n<p> </p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/3PtmgZN3jhU?si=pl5jAlpb5AtVRyqn\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div>\n<p> </p>",
            "image": "https://davidwk.io/media/posts/11/irobot.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "logseq",
                   "daily"
            ],
            "date_published": "2023-09-04T11:34:11-04:00",
            "date_modified": "2023-09-04T11:47:12-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-sep-3-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-3-2023/",
            "title": "Daily Post for Sep 3, 2023",
            "summary": "Yesterday I finally got back into the astronomy groove. After dreading the thought that it might cost another couple hundred dollars to fix the mount on which I already spent hundreds of dollars, I took a closer look at the issue and found it was simply a gear on the&hellip;",
            "content_html": "<p>Yesterday I finally got back into the astronomy groove. After dreading the thought that it might cost another couple hundred dollars to fix the mount on which I already spent hundreds of dollars, I took a closer look at the issue and found it was simply a gear on the RA motor that had been knocked slightly out of place. A few minor adjustments and everything was back in working order. After months of anxiety and doubt about whether or not to continue with this often frustrating hobby, finally a sigh of relief.</p>\n<p>That led to a fun evening of public outreach with the astronomy club. Despite an unfortunate setup site location (we can't see through trees, folks) we had a good turnout for the event at Miami Whitewater Forest. Lots of kids and families with a lot of interest. A few gasps from those who stayed late enough to see Saturn. One family almost \"bought\" a member's telescope when their kid tried to yeet (as the young people say) the tube backwards off the mount. A friendly but stern talking-to settled anyone else who might have been too amped-up about the universe.</p>\n<p>This means that tonight, weather permitting, I'll be able to setup the full rig with the camera and get back into EAA (electronically assisted astronomy - pictured above). The goal is to get the setup reliable enough that I can use it for public events. Polar alignment is the main issue as my process hasn't been very consistent so far. I should be able to pick up where I was and get some decent live images like below.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/10/gallery/IMG_0120.JPG\" data-size=\"1080x1080\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/10/gallery/IMG_0120-thumbnail.JPG\" alt=\"The Moon\" width=\"768\" height=\"768\"></a>\n<figcaption>The Moon</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/10/gallery/IMG_0126.jpeg\" data-size=\"2732x2048\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/10/gallery/IMG_0126-thumbnail.jpeg\" alt=\"The Whirlpool Galaxy\" width=\"768\" height=\"576\"></a>\n<figcaption>The Whirlpool Galaxy</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/10/gallery/IMG_0141.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/10/gallery/IMG_0141-thumbnail.PNG\" alt=\"The Needle Galaxy\" width=\"768\" height=\"576\"></a>\n<figcaption>The Needle Galaxy</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/10/gallery/IMG_0147.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/10/gallery/IMG_0147-thumbnail.PNG\" alt=\"The Ring Nebula\" width=\"768\" height=\"576\"></a>\n<figcaption>The Ring Nebula</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/10/gallery/IMG_0105.PNG\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/10/gallery/IMG_0105-thumbnail.PNG\" alt=\"The Dumbell Nebula\" width=\"768\" height=\"576\"></a>\n<figcaption>The Dumbell Nebula</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/10/gallery/IMG_0109.jpg\" data-size=\"1366x1024\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/10/gallery/IMG_0109-thumbnail.jpg\" alt=\"The Andromeda Galaxy\" width=\"768\" height=\"576\"></a>\n<figcaption>The Andromeda Galaxy</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://davidwk.io/media/posts/10/gallery/IMG_0110.jpg\" data-size=\"2732x2048\"><img loading=\"lazy\" src=\"https://davidwk.io/media/posts/10/gallery/IMG_0110-thumbnail.jpg\" alt=\"M13 The Hercules Cluster\" width=\"768\" height=\"576\"></a>\n<figcaption>M13 The Hercules Cluster</figcaption>\n</figure>\n</div></div>\n<p>For those interested, this setup uses a SkyQuest EQ mount, Svbony 80mm doublet refractor, ASI planetary camera (non-cooled), and the ASI Air Plus to control and capture. These images are all live-stacks of 60 seconds or less under light-polluted skies.</p>",
            "image": "https://davidwk.io/media/posts/10/IMG_0126.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily",
                   "astronomy"
            ],
            "date_published": "2023-09-03T08:59:19-04:00",
            "date_modified": "2023-09-03T09:00:04-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-sep-2-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-2-2023/",
            "title": "Daily Post for Sep 2, 2023",
            "summary": "I just finished episode 11 of \"The Uncanny Counter\" season 2. Final episode tomorrow. Right now, this is the best thing on television. It's damn near a perfect show. In related K-Drama news, \"Destined With You\" is really starting to grow on me after three episodes. I did a rare&hellip;",
            "content_html": "<p>I just finished episode 11 of \"The Uncanny Counter\" season 2. Final episode tomorrow. Right now, this is the best thing on television. It's damn near a perfect show. In related K-Drama news, \"Destined With You\" is really starting to grow on me after three episodes.</p>\n<p>I did a rare thing last night. I stayed up past my bedtime to go to a movie. \"The Equalizer 3\" was two hours of gore and violence punctuated by Denzel Washington being an absolute bad-ass. </p>\n<p>Tonight will be public astronomy outreach at a local park. Saturn should be amazing if we have clear skies. This will be my first time setting up a telescope in a while. I hope everything still works.</p>\n<p> </p>",
            "image": "https://davidwk.io/media/posts/9/the-uncanny-counter-season-two-9.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-09-02T11:29:26-04:00",
            "date_modified": "2023-09-02T11:29:26-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-sep-1-2023/",
            "url": "https://davidwk.io/daily-post-for-sep-1-2023/",
            "title": "Daily Post for Sep 1, 2023",
            "summary": "It's a huge week for K-Drama fans in America as the last two episodes of \"The Uncanny Counter\" season 2 get released. Rather than bitch that it's not the usual 16 episode season, I'm going to be happy that I got to see 12 more episodes of this fantastic show.",
            "content_html": "<p>It's a huge week for K-Drama fans in America as the last two episodes of \"The Uncanny Counter\" season 2 get released. Rather than bitch that it's not the usual 16 episode season, I'm going to be happy that I got to see 12 more episodes of this fantastic show. Later this month we get \"A Time Called You\" which, if the trailer is accurate, is going to destroy a lot of us fans, emotionally speaking.</p>\n<p>And on the subject of South Korea, my favorite country I've never been to, I read a fairly alarming article about how the birth rate, which is already the lowest in the world, has dropped once again. Science says a population needs a fertility rate of over 2% to sustain itself. South Korea's stands at 0.78%. Yikes! <a href=\"https://www.wsj.com/world/asia/worlds-lowest-birthrate-sinks-further-despite-cash-payouts-to-parents-23a92210\" target=\"_blank\" rel=\"noopener noreferrer\">Read the article</a>.</p>\n<p>It's a long weekend here in the US. It's Labor Day, which is traditionally the holiday dumb-ass Trumpers confuse with Memorial Day. That means we can expect the usual deluge of \"While you're stuffing your face at a cookout you libtards better not forget the soldiers who died so you could have the day off!\" posts. (FYI libtards is their word, not mine. I'm just using it to accurately represent the level of maturity in their social media.)</p>\n<p>I've been contemplating my career a bit lately, mostly as a result of my (first at this company) bad review from last year. A whole plethora (do you know what a plethora is?) of circumstances culminated in that particular situation, including some mental health setbacks. However there was some feedback from a peer on that review that was entirely false. I guess I was naive to think I'm too old to make enemies at work. But to the point, I've been considering whether or not I'm in the right role for myself at this point in time. It doesn't bring me the sense of accomplishment that it once did. I don't want to leave the company at all - it's a great place to work. But it's big enough that I could find something else that might make me happier. </p>\n<p>Yesterday the weather was so nice that, for a moment, I forgot about how fucked we are for continuing to destroy the environment. Please visualize that GIF of Nicolas Cage smiling, wind blowing through his hair in \"Con-Air\" for context. Watching Kid 5's soccer practice was a little less skin-cancerish for once.</p>\n<p> </p>",
            "image": "https://davidwk.io/media/posts/8/carlin-2.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-09-01T08:52:40-04:00",
            "date_modified": "2023-09-01T10:01:53-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-aug-31-2023/",
            "url": "https://davidwk.io/daily-post-for-aug-31-2023/",
            "title": "Daily Post for Aug 31, 2023",
            "summary": "Today was \"medicine check\" day with my psychiatrist. Switched things up a little bit because I'm still in kind of a recovery mode from my terrible '22. With the right kind of stimulant, I'm the person I want to be - confident, pro-active, productive, outgoing. Vyvanse, the stuff I was&hellip;",
            "content_html": "<p>Today was \"medicine check\" day with my psychiatrist. Switched things up a little bit because I'm still in kind of a recovery mode from my terrible '22. With the right kind of stimulant, I'm the person I want to be - confident, pro-active, productive, outgoing. Vyvanse, the stuff I was taking before, was total shit for me. It did nothing but increase my anxiety and dull my personality. </p>\n<p>I don't know how it's possible, but I lost 5 more pounds. I'm still in fat-ass territory, but I'm lucky to be at this point with the way I've been eating lately. I wish there was a coma diet. Just put me under for a couple months and feed me intravenously. </p>\n<p>Yesterday in the office was pretty good. Got to meet some people face to face for the first time, saw a few work friends, and saw a lot of people from my old team. Free food was a bonus. It's a shame, though...they completely remodeled the office with all this great collaboration equipment, but it rarely gets used. Not that I want to go back full time (the drive sucks), but I hate to see it go to waste.</p>\n<p>It's a story too long to tell, but I've been dealing with a charge for training that I wasn't supposed to pay for. My part was $400, but through a series of unfortunate clicks, I paid $3600. The refund is somewhere between PayPal and my bank, a kind of purgatory that I wouldn't wish on my worst enemy. </p>\n<p>I'm diving deeper into automation with Power Automate and Teams at work. Not my job, but a skill that really helps me streamline things for my team. Going to start taking some training and impress the shit out of people.</p>\n<p>Fun note: go check out <a href=\"https://ideogram.ai\" target=\"_blank\" rel=\"noopener noreferrer\">ideogram.ai</a>. It's a pretty good AI picture generator. The logo for my site was created with it, as was the featured image for this post.</p>",
            "image": "https://davidwk.io/media/posts/7/totoro_ai.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-08-31T12:38:35-04:00",
            "date_modified": "2023-08-31T13:05:02-04:00"
        },
        {
            "id": "https://davidwk.io/daily-post-for-aug-30-2023/",
            "url": "https://davidwk.io/daily-post-for-aug-30-2023/",
            "title": "Daily Post for Aug 30, 2023",
            "summary": "On Wednesdays we go to the office. At least that's what I'm doing starting today. Ever since the pandemic I've been 100% work from home. While that appeals to my introverted leanings, it's proven over time to not be a healthy way to exist. I like the people I work&hellip;",
            "content_html": "<p>On Wednesdays we go to the office. At least that's what I'm doing starting today. Ever since the pandemic I've been 100% work from home. While that appeals to my introverted leanings, it's proven over time to not be a healthy way to exist. I like the people I work with and I enjoy seeing them, but it's mentally and physically exhausting. I already have to medicate extensively to be a functional human being, what with the bi-polar, ADHD, and raging social anxiety. Being around people exasperates that 10 times over. I know a lot of people can relate to having bad brain chemistry. It sucks, but we survive.</p>\n<p>Everyone in the house but me has colds. Part of me wants to check into a hotel so I don't have to be around a group of \"patient zeroes\". The other part of me thinks I'm probably playing it up a bit. </p>\n<p>I've not been watching my diet very much (translated - at all) lately. I haven't stepped on a scale in a couple of months, either. I was doing pretty well at 20 lbs. lost, but I feel like I've been stress-eating. I should probably do something about the situation, but I'm not going to lie and say I'm feeling motivated to. I feel like I'm mentally in a rut...not happy with myself, but not yet prepared to move forward. Mental health is weird.</p>\n<p>Time to get ready to make the drive to work. At this point I'm stalling. Happy Wednesday!</p>",
            "image": "https://davidwk.io/media/posts/6/wednesdays.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2023-08-30T07:28:28-04:00",
            "date_modified": "2023-08-30T07:28:28-04:00"
        },
        {
            "id": "https://davidwk.io/my-k-drama-list-2/",
            "url": "https://davidwk.io/my-k-drama-list-2/",
            "title": "My K-Drama List",
            "summary": "I'm a HUGE fan of South Korean television, more commonly referred to as \"K-Drama\". It started with \"Squid Game\", but it didn't take me long to deep-dive into the enormous K-Drama library on Netflix. \"Extraordinary Attorney Woo\" was the show that really hooked me. Since then, most of my streaming&hellip;",
            "content_html": "<p>I'm a HUGE fan of South Korean television, more commonly referred to as \"K-Drama\". It started with \"Squid Game\", but it didn't take me long to deep-dive into the enormous K-Drama library on Netflix. \"Extraordinary Attorney Woo\" was the show that really hooked me. Since then, most of my streaming time has been spent on South Korean television. <br><br>I'm going to be slowly expanding this list to include my thoughts on each show, and I'll be using tags to help others sort through them and find things they like. For now, and without any spoilers, here are some quick recommendations. Unless specified otherwise, these are all available on Netflix in the US.<br><br><strong>My Personal Favorite</strong></p>\n<ul>\n<li>Extraordinary Attorney Woo</li>\n</ul>\n<p><strong>RomCom Shows</strong></p>\n<ul>\n<li>Because This is My First Life</li>\n<li>Romance is a Bonus Book</li>\n</ul>\n<p><strong>Dramatic Love Stories</strong></p>\n<ul>\n<li>Twenty-Five Twenty-One</li>\n<li>Rain or Shine</li>\n</ul>\n<p><strong>Supernatural Shows</strong></p>\n<ul>\n<li>The Uncanny Counter</li>\n<li>Tomorrow</li>\n</ul>\n<p><strong>Action Dramas</strong></p>\n<ul>\n<li>My Name</li>\n<li>The Glory</li>\n</ul>\n<h2>The List</h2>\n<table class=\"align-left\" style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 40.7989%; background-color: #ced4d9;\"><strong>Title</strong></td>\n<td style=\"width: 34.0897%; background-color: #ced4d9;\"><strong>Korean Title</strong></td>\n<td style=\"width: 25.1115%; background-color: #ced4d9;\"><strong>Recommended?</strong></td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Because This is My First Life</td>\n<td style=\"width: 34.0897%;\">이번 생은 처음이라</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Summer Strike</td>\n<td style=\"width: 34.0897%;\">아무것도 하고 싶지 않아</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">The Silent Sea</td>\n<td style=\"width: 34.0897%;\">고요의 바다</td>\n<td style=\"width: 25.1115%;\">Maybe</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\"><a href=\"https://davidwk.io/review-why-i-dont-recommend-do-do-sol-sol-la-la-sol\"><span style=\"color: #313339;\">Do Do Sol Sol La La Sol</span></a></td>\n<td style=\"width: 34.0897%;\">도도솔솔라라솔</td>\n<td style=\"width: 25.1115%;\">No</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Tomorrow</td>\n<td style=\"width: 34.0897%;\">내일</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Extraordinary Attorney Woo</td>\n<td style=\"width: 34.0897%;\">이상한 변호사 우영우</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Hometown Cha Cha Cha</td>\n<td style=\"width: 34.0897%;\">갯마을 차차차</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">It’s Okay to Not Be Okay</td>\n<td style=\"width: 34.0897%;\">사이코지만 괜찮아</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Start Up</td>\n<td style=\"width: 34.0897%;\">스타트업</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Twenty-Five Twenty-One</td>\n<td style=\"width: 34.0897%;\">스물다섯 스물하나</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">My Liberation Notes</td>\n<td style=\"width: 34.0897%;\">나의 해방일지</td>\n<td style=\"width: 25.1115%;\">Maybe</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Romance is a Bonus Book</td>\n<td style=\"width: 34.0897%;\">로맨스는 별책부록</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">King the Land</td>\n<td style=\"width: 34.0897%;\">킹더랜드</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Rain or Shine</td>\n<td style=\"width: 34.0897%;\">그냥 사랑하는 사이</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">The Uncanny Counter</td>\n<td style=\"width: 34.0897%;\">경이로운 소문</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">The Glory</td>\n<td style=\"width: 34.0897%;\">더 글로리</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Hellbound</td>\n<td style=\"width: 34.0897%;\">지옥</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Squid Game</td>\n<td style=\"width: 34.0897%;\">오징어 게임</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">My Name</td>\n<td style=\"width: 34.0897%;\">마이 네임</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Crash Course in Romance</td>\n<td style=\"width: 34.0897%;\">일타 스캔들</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n<tr>\n<td style=\"width: 40.7989%;\">Inspector Koo</td>\n<td style=\"width: 34.0897%;\">구경이</td>\n<td style=\"width: 25.1115%;\">Yes</td>\n</tr>\n</tbody>\n</table>",
            "image": "https://davidwk.io/media/posts/5/uncanny.jpeg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "k-drama"
            ],
            "date_published": "2023-08-29T15:46:29-04:00",
            "date_modified": "2023-08-29T15:59:53-04:00"
        },
        {
            "id": "https://davidwk.io/review-why-i-dont-recommend-do-do-sol-sol-la-la-sol/",
            "url": "https://davidwk.io/review-why-i-dont-recommend-do-do-sol-sol-la-la-sol/",
            "title": "K-Review - Why I Don&#x27;t Recommend &quot;Do-Do-Sol-Sol-La-La-Sol&quot;",
            "summary": "It's not often that I find a K-Drama that I won't recommend. Although I personally find most of the writing on South Korean television shows thoughtful and intentional, they're still subject to some of the usual pitfalls of any scripted show. Almost always, though, I find something about them to&hellip;",
            "content_html": "<p>It's not often that I find a K-Drama that I won't recommend. Although I personally find most of the writing on South Korean television shows thoughtful and intentional, they're still subject to some of the usual pitfalls of any scripted show. Almost always, though, I find something about them to recommend. </p>\n<p>\"Do-Do-Sol-Sol-La-La-Sol\" is one of the few I can't, in good conscience, recommend at all, despite all but the last five minutes being wonderful. What happens in those five minutes ruins everything that comes before it, though. My opinion, of course. Your enjoyment may have varied if you've seen it. <span style=\"color: #e03e2d;\"><strong>Spoilers beyond this point</strong></span>.</p>\n<p>The male lead in \"Do-Do-Sol-Sol-La-La-Sol\" has a real problem with telling the truth. He has his reasons, but as the show goes on and he continues to lie to his girlfriend, you really have to wonder how she trusts him. It's the final lie that's the unforgivable sin for me, though.</p>\n<p>In the final episode, everyone is dealing with the death of Sunwoo Joon (Lee Jae-wook), the male lead and boyfriend of Goo Ra-ra (Go Ara), the charasmatic female lead. Sunwoo Joon's mother revealed in the penultimate episode that he had died from MS. Although heart-breaking, the final episode has some fantastic insight into dealing with grief and how different people move on in different ways. </p>\n<p>The problem is - Sunwoo Joon isn't actually dead! In the closing moments we get a \"5 years later\" prompt and we see how Ra-ra has dealt with her loss. Her piano academy is flourishing, her friends are all still there, supporting her. She's done well. Then in a scene that's confusing as hell, we see Joon, dressed in all black, running up to the academy building. Her bursts through the door and a total shit-show ensues.</p>\n<p>The final scene is Ra-ra and Joon sitting in a park, her crying uncontrollably and confused out of her mind. Joon tells her that he, once again, lied about being dead because he wanted to complete his treatment first (it takes 5 years to cure MS?). Add this to the long list of lies that included \"I'm studying abroad\" while in the hospital, \"I'm actually 19 and a high school senior\" instead of 23, and \"I'm just a tacitern loner\" instead of a run-away who hates his parents.</p>\n<p>The writers took a beautiful story about love, loss, grief, and perseverence and threw it into the trash because they couldn't stand a world where this couple isn't together. That final scene feels tacked-on, like a committee of executives decided that the audience wasn't intelligent enough to deal with such an emotional ending. It's a shame because this was almost one of my favorite shows.</p>\n<p>If you want to watch it, all I can recommend is that you turn it off when you see the screen say \"5 years later\". Accept that as the ending and maybe you'll find the show more enjoyable because you can't un-see the ending they actually give you.</p>",
            "image": "https://davidwk.io/media/posts/3/Do-Do-Sol-Sol-La-La-Sol3.jpg",
            "author": {
                "name": "David K"
            },
            "tags": [
                   "review",
                   "k-drama"
            ],
            "date_published": "2023-08-29T11:56:36-04:00",
            "date_modified": "2023-09-01T09:02:17-04:00"
        }
    ]
}
